ArtShare/app/controllers/users_controller.rb

  def index
    if params[:query]
      @users = User.where('username LIKE ?', "%#{params[:query]}%")
    else
      @users = User.all
---
SELECT "users".* FROM "users"

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Ishti"], ["email", "20"], ["created_at", "2018-12-20 19:28:43.375873"], ["updated_at", "2018-12-20 19:28:43.375873"]]

  def update
    user = User.find(params[:id])
    if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "ish@gmail.com"], ["updated_at", "2018-12-20 19:38:42.122872"], ["id", 3]]